9/data/attachments/e1d75cdc5e805736.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_034437aa-e179-48af-b527-98e33272c2ae</nif:username>
            <nif:friendToBeAdded>Andrew_relationship_Actions_38081_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>